"""
    一家公司岗位与员工情况如下：
        经理："曹操","刘备","孙权"
        技术："曹操","刘备","张飞","关羽"

    1. 定义数据结构,存储以上信息.
    2. 是经理也是技术的都有谁?
    3. 是经理也不是技术的都有谁?
    4. 不是经理也是技术的都有谁?
    5. 身兼一职的都有谁?
    6. 公司总共有多少人数?
"""
# 字典内嵌集合
dict_com = {
    "经理": {"曹操", "刘备", "孙权"},
    "技术": {"曹操", "刘备", "张飞", "关羽"}
}
print(dict_com["经理"] & dict_com["技术"])  # 交集
print(dict_com["经理"] - dict_com["技术"])  # 补集
print(dict_com["技术"] - dict_com["经理"])  # 补集
print(dict_com["经理"] ^ dict_com["技术"])  # 补集
print(len(dict_com["经理"] | dict_com["技术"]))  # 并集
